{
  "stories": [
    {
      "title": "Scotland Diaries",
      "description": "I’ve traveled many places in my life. The Isle of Skye is not one of them, alas. Through familial ties and love of a heavily peated single malt, I can say Scotland and the Hebrides has been my playground on many an occasion.Like you too, most of my trips I’m prepared with every option, explored every possible adventure, flipped schedules back and forth to make sure I’m squeezing every ounce of juice out of the orange. We’ve all hated hindsight when we wish we could have traded an extra night in town X instead of dreary town Z. The islands off the west coast of Scotland are different. Now maybe Skye is different because it’s connected to the mainland by bridge. Maybe tourism has changed its way of life from the other islands. I don’t know, I’ve never been.This is my experience on the islands. From the moment, you step across the CalMac gangplank, it’s magic. As the coastline recedes, so does time. Check your timepiece, it’s slowed to the new pace too. You go back in time to communities that have grown up together, survived together and celebrated together. The guy at the ferry dock went to school with your B&B host 40 years ago and the wife took care of his mom before she passed. It’s that interrelated.Suddenly it hits you how isolated but connected you are here. A few small communities scattered across an island. In winter the winds and gales can kick up such that no ferry or plane dare cross the Hebridean Sea. How these small enclaves clung to the land over the years enduring the clearances, famine, even war time creating this magical fairy tale land of physical beauty but also social idyllic.The islands are a place to find yourself in. Learn how to breathe again.What I’m trying to express is the beauty and allure of the islands for me isn’t in the Instagram worthy sights, museums or castles. It is the enduring ruggedness and grit of the land and its people bobbing around on an island in an angry sea. Take the time to stand still.",
      "id": "622e83b9-df9f-4fd7-dc94-c4d6cd616204"
    },
    {
      "title": "The Most Beautiful States in the USA",
      "description": "Early last year, before the global pandemic put the kibosh on the trips I was going to take, I was lucky to do some traveling. I have officially postponed my trip to the Middle East until the fall of 2021, and I’m about 50–50 on whether to postpone further. I could just skip adding any new content on my blog, but I thought I might share a little about my past travels from the perspective of time.I’ve visited all fifty of the United States. To be fair, I shouldn’t say I visited them all. But I’ve at least been in them all. Some of them I have not seen nearly enough of to make a judgment. But all I can do is offer an opinion based on what I have seen of each state. I’m basing my rankings primarily on natural beauty, but sometimes cityscapes can be as appealing as landscapes and vistas. Driving over a mountain pass and seeing a charming village nestled in the valley below can inspire oohs and aahs, as can urban skylines and parks. After the top ten, I’ll give a few honorable mentions. I will also name my #50, the ugliest state I’ve seen. I should say that the order of these top ten is really arbitrary. All ten of these states have astonishing scenery. On another day, I might rethink my rankings and move things around a lot. I’ve already done a lot of that.",
      "id": "1359721a-1a32-4590-8831-2d7954b5c0e3",
      "favorite": true
    },
    {
      "title": "Oregon",
      "description": "When I did a two-week road trip in Oregon back in 2013, I was continually knocked over by how amazing the scenery is. The coastline is jaw-dropping. The small cities of Grants Pass, Medford, and Ashland, in the southwest corner of the state, are charming and set in lovely valleys. Crater Lake is idyllic. The high desert areas around Bend and the Deschutes River and up toward Smith Rock State Park offer no end of visual delights. The John Day Fossil Beds National Monument covers a vast area in the central part of the state. Mt. Hood must be among the prettiest and most majestic mountains in the world. The Columbia River Gorge is a feast of glorious waterfalls. And driving between all these sites, it’s hard not to stop continually to gawk at the views.",
      "id": "2aff9b33-73f1-4004-e510-52821286d901"
    },
    {
      "title": "A love letter to Diani",
      "description": "From a distance, it sounds like rainfall. If only my legs can take larger strides so that I can see the ocean a mere seconds quicker. Welcomed by century-old baobab trees, we finally lay eyes on where the land greets the ocean. I remove my shoes and place my feet on the deep, white sands that stretch far and wide. My toes are met with a soft and fine texture, so fine that my legs keep sinking in. I bend to grab some sand in my fist and it sifts through the tiny fissures in between my fingers, blown away by the cold breeze as it lands back to the ground. I do not want to say goodbye, not yet. I do not want to say goodbye ever. I want to slow down the time so that I remain right here on the beach, dancing with my friends like no one is watching — even though multiple pairs of eyes stare at us right now. I do not want to be a tourist here. I want to call it home. Why must we say goodbye to the best moments of our life? …because there is better waiting for us when we take a faithful leap into the unknown future. I shall be back, but for now, see you soon Diani.",
      "id": "2c1030b7-a9d4-4a20-e00c-7694bbfb1778"
    },
    {
      "title": "How a trip to the Danish countryside healed me.",
      "description": "It’s incredible how healing travel can be. While I’m not in total dire straits, I’ve been rocked to my core by a series of stressful events this month. I’ve recognised that something has to change, and that change only comes from within. Upon returning from Nice a few weeks ago, I began to feel intense waves of self doubt, questioning who I am, where I’m going, and what I actually want in life. This led to hesitation about an upcoming trip to Denmark, but as time progressed, I’d come to discover that this trip was exactly what I needed. Who knew a journey to the remote Danish countryside would be so impactful. For starters, this destination in Denmark is extremely isolated. With just 480 inhabitants, Vesterende Ballum is quaint and eerily quiet. I’ll set the scene: lush farmland full of cows, sheep, horses, and goats roaming for nutrients without a care in the world. 16th and 17th century cottages are generously spaced apart, accompanied by thatched or tiled roofs and lovely gardens. Despite the stereotype that most Scandinavians are cold and reserved, a few locals waved as we entered the village, hefty wine glasses in hand. We stayed in a vacation rental home, North Sea view and all. The spacious accommodation had 10 Dutchies (plus me, the American Brit) feeling “hygge” right away.",
      "id": "7a6a9ccd-2db9-4585-988a-a76725e0bb40"
    }
  ],
  "favicon.ico": []
}
